In [3]:
import pandas as pd

In [16]:
df = pd.read_csv("titanic.csv")

In [17]:
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [18]:
df.drop(labels = ["SexCode"], axis=1, inplace=True)
#eger df'e kayit edip devam etmek istiyorsan ya df= diyip devam etmemiz ya da inplace=True diyerek devam etmemiz gerekiyor.

In [19]:
df.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [23]:
df.drop(df[df["Sex"]!="male"].index)

                                     Name PClass    Age   Sex  Survived
2     Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0
4           Allison, Master Hudson Trevor    1st   0.92  male         1
5                      Anderson, Mr Harry    1st  47.00  male         1
7                  Andrews, Mr Thomas, jr    1st  39.00  male         0
9                  Artagaveytia, Mr Ramon    1st  71.00  male         0
...                                   ...    ...    ...   ...       ...
1308                   Zakarian, Mr Artun    3rd  27.00  male         0
1309               Zakarian, Mr Maprieder    3rd  26.00  male         0
1310                     Zenni, Mr Philip    3rd  22.00  male         0
1311                     Lievens, Mr Rene    3rd  24.00  male         0
1312                       Zimmerman, Leo    3rd  29.00  male         0

[851 rows x 5 columns]

In [26]:
df.drop_duplicates(subset=["Sex"], keep="last")

                     Name PClass   Age     Sex  Survived
1307  Zabour, Miss Tamini    3rd   NaN  female         0
1312       Zimmerman, Leo    3rd  29.0    male         0

In [28]:
df.groupby(by=["Sex"]).mean()

              Age  Survived
Sex
female  29.396424  0.666667
male    31.014338  0.166863

In [29]:
df.groupby(by=["Sex"]).count()

        Name  PClass  Age  Survived
Sex
female   462     462  288       462
male     851     851  468       851

In [31]:
df.groupby(by=["Sex", "Survived"]).mean()

                       Age
Sex    Survived
female 0         24.901408
       1         30.867143
male   0         32.320780
       1         25.951875

In [34]:
for name in df["Name"][:10]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON
ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
ALLISON, MASTER HUDSON TREVOR
ANDERSON, MR HARRY
ANDREWS, MISS KORNELIA THEODOSIA
ANDREWS, MR THOMAS, JR
APPLETON, MRS EDWARD DALE (CHARLOTTE LAMSON)
ARTAGAVEYTIA, MR RAMON

In [35]:
def uppercase(x):
    return x.upper()

In [36]:
df["Name"].apply(uppercase)

0                        ALLEN, MISS ELISABETH WALTON
1                         ALLISON, MISS HELEN LORAINE
2                 ALLISON, MR HUDSON JOSHUA CREIGHTON
3       ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
4                       ALLISON, MASTER HUDSON TREVOR
                            ...
1308                               ZAKARIAN, MR ARTUN
1309                           ZAKARIAN, MR MAPRIEDER
1310                                 ZENNI, MR PHILIP
1311                                 LIEVENS, MR RENE
1312                                   ZIMMERMAN, LEO
Name: Name, Length: 1313, dtype: object

In [48]:
data_a = {'id': ['1', '2', '3'],
'isim': ['Mert', 'Fethi', 'Makber'],
'soyisim': ['Cobanov', 'Tekyaygil', 'Blackwater']}

data_b = {'id': ['4', '5', '6'],
'isim': ['Kadir', 'Yasemin', 'Melis'],
'soyisim': ['Gates', 'Currie', 'Lisa']}

In [49]:
df_a = pd.DataFrame(data_a)
df_b = pd.DataFrame(data_b)

In [53]:
concat_df = pd.concat([df_a, df_b], axis=0)

In [54]:
concat_df.head()

  id     isim     soyisim
0  1     Mert     Cobanov
1  2    Fethi   Tekyaygil
2  3   Makber  Blackwater
0  4    Kadir       Gates
1  5  Yasemin      Currie

In [55]:
employee_data = {'employee_id': ['1', '2', '3', '4'],
'name': ['Mert Cobanov', 'FethiTekyaygil', 'Segaf Blackwater', 'Tim Horton']}

sales_data = {'employee_id': ['3', '4', '5', '6'],
'total_sales': [23456, 2512, 2345, 1455]}

In [56]:
employee = pd.DataFrame(employee_data)
sales = pd.DataFrame(sales_data)

In [61]:
pd.merge(employee, sales, on="employee_id", how='right')

  employee_id              name  total_sales
0           3  Segaf Blackwater        23456
1           4        Tim Horton         2512
2           5               NaN         2345
3           6               NaN         1455